wyniki_zwykle/fio_results_btrfs_nvme/block_size_16384_compression_none/lab-sec-16/fio_webserver_test_output.txt
webserver_test: (g=0): rw=randread, bs=(R) 4096B-8192B, (W) 4096B-8192B, (T) 4096B-8192B, ioengine=libaio, iodepth=32
...
fio-3.36
Starting 16 processes
webserver_test: Laying out IO file (1 file / 2048MiB)
webserver_test: Laying out IO file (1 file / 2048MiB)
webserver_test: Laying out IO file (1 file / 2048MiB)
[...]

webserver_test: (groupid=0, jobs=16): err= 0: pid=399185: Sat May  3 08:54:05 2025
  read: IOPS=293k, BW=1220MiB/s (1279MB/s)(32.0GiB/26856msec)
    slat (usec): min=2, max=8630, avg= 6.76, stdev=17.62
    clat (usec): min=53, max=14497, avg=1734.50, stdev=937.32
     lat (usec): min=60, max=14525, avg=1741.26, stdev=938.06
    clat percentiles (usec):
     |  1.00th=[  273],  5.00th=[  441], 10.00th=[  586], 20.00th=[  848],
     | 30.00th=[ 1106], 40.00th=[ 1352], 50.00th=[ 1631], 60.00th=[ 1909],
     | 70.00th=[ 2212], 80.00th=[ 2573], 90.00th=[ 2966], 95.00th=[ 3458],
     | 99.00th=[ 4146], 99.50th=[ 4293], 99.90th=[ 4490], 99.95th=[ 4621],
     | 99.99th=[ 4948]
   bw (  MiB/s): min=  911, max= 1424, per=100.00%, avg=1224.29, stdev=13.12, samples=848
   iops        : min=223490, max=337980, avg=294248.57, stdev=2948.59, samples=848
  lat (usec)   : 100=0.01%, 250=0.67%, 500=6.32%, 750=9.20%, 1000=9.91%
  lat (msec)   : 2=36.87%, 4=35.20%, 10=1.82%, 20=0.01%
  cpu          : usr=3.23%, sys=12.72%, ctx=5912662, majf=0, minf=1198
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=7877354,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=1220MiB/s (1279MB/s), 1220MiB/s-1220MiB/s (1279MB/s-1279MB/s), io=32.0GiB (34.4GB), run=26856-26856msec